9/data/attachments/a9879a1e710f14de.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_08dddee8-a5fa-454e-b38a-8c429f776567</nif:username>
            <nif:friendToBeAdded>Gloria_difficult_Actions_28152_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>